quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': "Какой самый большой океан на Земле?",
        'options': ["Атлантический", "Индийский", "Тихий", "Северный Ледовитый"],
        'correct_option': 2
    },
    {
        'question': "Какой элемент имеет химический символ 'O'?",
        'options': ["Золото", "Кислород", "Углерод", "Азот"],
        'correct_option': 1
    },
    {
        'question': "Какой год считается годом основания Рима?",
        'options': ["753 до н.э.", "500 до н.э.", "1000 н.э.", "476 н.э."],
        'correct_option': 0
    },
    {
        'question': "Кто написал 'Войну и мир'?",
        'options': ["Федор Достоевский", "Лев Толстой", "Антон Чехов", "Александр Пушкин"],
        'correct_option': 1
    },
    {
        'question': "Какой континент является самым маленьким по площади?",
        'options': ["Европа", "Австралия", "Антарктида", "Южная Америка"],
        'correct_option': 1
    },
    {
        'question': "Какой язык является самым распространенным в мире?",
        'options': ["Испанский", "Китайский", "Английский", "Хинди"],
        'correct_option': 1
    },
    {
        'question': "Какой планетой является 'Красная планета'?",
        'options': ["Венера", "Марс", "Юпитер", "Сатурн"],
        'correct_option': 1
    },
    {
        'question': "Какой самый высокий пик на Земле?",
        'options': ["К2", "Эверест", "Монблан", "Килиманджаро"],
        'correct_option': 1
    },
]